app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sei la"], ["created_at", "2017-11-29 14:03:20.676296"], ["updated_at", "2017-11-29 14:03:20.676296"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "sdsadvf"], ["updated_at", "2017-12-04 00:07:38.241515"], ["id", 5]]