app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "amount", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "cascasc"], ["description", "cacs"], ["amount", 0], ["value", "0.0"], ["created_at", "2017-12-04 01:02:05.482765"], ["updated_at", "2017-12-04 01:02:05.482765"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "amount" = $1, "value" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["amount", 10], ["value", "18.0"], ["updated_at", "2017-12-04 01:03:18.521534"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)