app/views/products/_form.html.erb


    <%= select("post", "category", Category.all.collect {|p| [ p.name, p.id ] }, { include_blank: true })%>
---
SELECT "categories".* FROM "categories"